wei134102/OpenFIRE-Firmware-ESP32/src/main.cpp
                          // Update display to show new layout
                          #ifdef USES_DISPLAY
                              // 显示状态栏提示
                              FW_Common::OLED.TopPanelUpdate(OF_Prefs::profiles[OF_Prefs::currentProfile].irLayout == OF_Const::layoutDiamond ? "Layout: Diamond" : "Layout: Square");
                              delay(1000); // 显示1秒状态提示
                              FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_LayoutToggle);
                          #endif // USES_DISPLAY
                          
                          // Provide visual feedback with color corresponding to layout type
                          #ifdef LED_ENABLE
                              if(OF_Prefs::profiles[OF_Prefs::currentProfile].irLayout == OF_Const::layoutDiamond) {
                                  // Diamond layout - purple
                                  OF_RGB::LedUpdate(128,0,128);
                              } else {
                                  // Square layout - blue
                                  OF_RGB::LedUpdate(0,0,255);
                              }
                              delay(500);
                              OF_RGB::SetLedPackedColor(OF_Prefs::profiles[OF_Prefs::currentProfile].color);
                          #endif // LED_ENABLE
                          
                          // Save the layout change
                          OF_Prefs::SaveProfiles();
                          
                          break;
                        case FW_Const::PauseMode_GunId:
                          pauseModeSelectingGunId = true;
                          gunIdModeSelection = (uint8_t)(OF_Prefs::settings[OF_Const::gunId] % 4);
                          if(!OF_Serial::serialMode) {
                              Serial.println("Gun ID: select P1-P4");
                          }
                          #ifdef USES_DISPLAY
                              FW_Common::OLED.PauseProfileUpdate(gunIdModeSelection, "P1", "P2", "P3", "P4");
                          #endif
                          break;
                        // 在这里插入新的 死区 case
                        case FW_Const::PauseMode_AnalogDeadzone:
                        // 死区步进：0,5,10,15,20,25,30%，用 Trigger 循环切换
                        {
                            // 当前值
                            uint32_t dz = OF_Prefs::settings[OF_Const::analogDeadzone];
                            if (dz > 30) dz = 30;

                            // 进入该选项时先显示当前死区值，避免画面空白
                            #ifdef USES_DISPLAY
                                {
                                    char buf[24];
                                    snprintf(buf, sizeof(buf), "Deadzone: %u%%", (unsigned)dz);
                                    FW_Common::OLED.TopPanelUpdate(buf);
                                    FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_AnalogDeadzone);
                                }
                            #endif

                            // 这里已经是 Trigger 的一次“按下并松开”事件，不需要再检测 pressed
                            static const uint8_t steps[] = {0,5,10,15,20,25,30};
                            int index = 0;
                            for (int i = 0; i < 7; ++i) {
                                if (dz <= steps[i]) { index = i; break; }
                            }
                            // 下一档，循环
                            index = (index + 1) % 7;
                            dz = steps[index];
                            OF_Prefs::settings[OF_Const::analogDeadzone] = dz;
                            OF_Prefs::SaveSettings();

                            if (!OF_Serial::serialMode) {
                                Serial.print("Analog deadzone set to ");
                                Serial.print(dz);
                                Serial.println("%");
                            }
                            #ifdef USES_DISPLAY
                                char buf[24];
                                snprintf(buf, sizeof(buf), "Deadzone: %u%%", (unsigned)dz);
                                FW_Common::OLED.TopPanelUpdate(buf);
                                FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_AnalogDeadzone);
                            #endif
                        }
                        break;
                        case FW_Const::PauseMode_AnalogCenterCal:
                        {
                            int pinX = OF_Prefs::pins[OF_Const::analogX];
                            int pinY = OF_Prefs::pins[OF_Const::analogY];
                            if (pinX < 0 || pinY < 0) {
                                if (!OF_Serial::serialMode)
                                    Serial.println("CenterCal: analog pins not set (analogX/analogY)");
                                break;
                            }
                            // 读取当前模拟值，以当前物理位置作为“新中心”
                            int analogValueX = analogRead(pinX);
                            int analogValueY = analogRead(pinY);

                            int32_t offsetX = (int32_t)ANALOG_STICK_CENTER_X - (int32_t)analogValueX;
                            int32_t offsetY = (int32_t)ANALOG_STICK_CENTER_Y - (int32_t)analogValueY;

                            // 限制最大校正量，防止极端错误
                            const int32_t maxOffset = 512;
                            if (offsetX < -maxOffset) offsetX = -maxOffset;
                            if (offsetX >  maxOffset) offsetX =  maxOffset;
                            if (offsetY < -maxOffset) offsetY = -maxOffset;
                            if (offsetY >  maxOffset) offsetY =  maxOffset;

                            // settings.conf 是二进制保存/加载：这里直接以 int32 语义写入即可（两补码会被原样保存）
                            // 读取时再把 uint32_t 重新解释为 int32_t 使用
                            OF_Prefs::settings[OF_Const::analogCenterOffsetX] = (uint32_t)offsetX;
                            OF_Prefs::settings[OF_Const::analogCenterOffsetY] = (uint32_t)offsetY;
                            int saveErr = OF_Prefs::SaveSettings();
                            #ifdef USES_ANALOG
                            FW_Common::analogCenterJustCalibrated = true;  // 下次 AnalogStickPoll 会重置 IIR 滤波，中心立即生效
                            #endif

                            if (!OF_Serial::serialMode) {
                                Serial.print("CenterCal: rawX=");
                                Serial.print(analogValueX);
                                Serial.print(" rawY=");
                                Serial.print(analogValueY);
                                Serial.print(" -> offsetX=");
                                Serial.print(offsetX);
                                Serial.print(" offsetY=");
                                Serial.print(offsetY);
                                Serial.print(" storedX=");
                                Serial.print(OF_Prefs::settings[OF_Const::analogCenterOffsetX]);
                                Serial.print(" storedY=");
                                Serial.print(OF_Prefs::settings[OF_Const::analogCenterOffsetY]);
                                Serial.print(" Save=");
                                Serial.println(saveErr == 0 ? "OK" : "FAIL");
                            }
                            #ifdef USES_DISPLAY
                                FW_Common::OLED.TopPanelUpdate("Center calibrated");
                                FW_Common::OLED.PauseListUpdate((int)FW_Common::pauseModeSelection);
                            #endif
                        }
                        break;
                        case FW_Const::PauseMode_AxisUnsignedToggle:
                        {
                            // 切换轴输出模式：Signed(-32767~32767) / Unsigned(0~max)
                            uint32_t mode = 0;
                            if (OF_Const::settingsTypesCount > OF_Const::axisUnsigned) {
                                mode = OF_Prefs::settings[OF_Const::axisUnsigned];
                            }
                            mode = mode ? 0 : 1; // 0 -> 1, 1 -> 0
                            OF_Prefs::settings[OF_Const::axisUnsigned] = mode;
                            OF_Prefs::SaveSettings();

                            Gamepad16.unsignedAxis = (mode != 0);

                            if (!OF_Serial::serialMode) {
                                Serial.print("Axis mode set to ");
                                Serial.println(mode ? "Unsigned (Joypad-OS)" : "Signed");
                            }
                            #ifdef USES_DISPLAY
                                FW_Common::OLED.TopPanelUpdate(mode ? "Axis: Unsigned" : "Axis: Signed");
                                FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_AxisUnsignedToggle);
                            #endif
                        }
                        break;
 //wei134102 add end                             
                        #ifdef USES_RUMBLE
                        case FW_Const::PauseMode_RumbleFFToggle:
                          if(!OF_Serial::serialMode)
                              Serial.println("Toggling Rumble FFB!");
                          // Toggle rumbleFF state
                          OF_Prefs::toggles[OF_Const::rumbleFF] = !OF_Prefs::toggles[OF_Const::rumbleFF];
                          
                          // Save the setting
                          OF_Prefs::SaveToggles();
                          
                          // Update display
                          #ifdef USES_DISPLAY
                              // 显示状态栏提示
                              FW_Common::OLED.TopPanelUpdate(OF_Prefs::toggles[OF_Const::rumbleFF] ? "Rumble FFB: ON" : "Rumble FFB: OFF");
                              delay(1000); // 显示1秒状态提示
                              FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_RumbleFFToggle);
                          #endif // USES_DISPLAY
                          
                          // Provide visual feedback
                          #ifdef LED_ENABLE
                              if(OF_Prefs::toggles[OF_Const::rumbleFF]) {
                                  // Green for ON
                                  OF_RGB::LedUpdate(0,255,0);
                              } else {
                                  // Red for OFF
                                  OF_RGB::LedUpdate(255,0,0);
                              }
                              delay(500);
                              OF_RGB::SetLedPackedColor(OF_Prefs::profiles[OF_Prefs::currentProfile].color);
                          #endif // LED_ENABLE
                          
                          break;                        
                        case FW_Const::PauseMode_RumbleToggle:
                          if(!OF_Serial::serialMode)
                              Serial.println("Toggling rumble!");
                          RumbleToggle();
                          break;
                        #endif // USES_RUMBLE
                        #ifdef USES_SOLENOID
                        case FW_Const::PauseMode_SolenoidToggle:
                          if(!OF_Serial::serialMode)
                              Serial.println("Toggling solenoid!");
                          SolenoidToggle();
                          break;
                        #endif // USES_SOLENOID
                        /*
                        #ifdef USES_SOLENOID
                        case FW_Const::PauseMode_BurstFireToggle:
                          Serial.println("Toggling solenoid burst firing!");
                          BurstFireToggle();
                          break;
                        #endif // USES_SOLENOID
                        */
                        case FW_Const::PauseMode_EscapeSignal:
                          SendEscapeKey();

